IDEA Open Model
ReinfBarByPolyline.BarDistance Property
Compatible with IDEA StatiCa v 10.1
 Vector determining direction of reinforcement layers, vector is defined in local coordinates of first segment
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public Vector3D BarDistance { get; set; }
Public Property BarDistance As Vector3D
	Get
	Set
public:
property Vector3D^ BarDistance {
	Vector3D^ get ();
	void set (Vector3D^ value);
}
Property Value
Type: Vector3D
See Also
Reference
ReinfBarByPolyline Class
IdeaRS.OpenModel.Detail Namespace